In [19]:
"""
pandas 데이터 입출력

pandas는 CSV(Comman Separated Value)를 포함한
다양한 포맷의 데이터 파일을 읽어 직접 데이터프레임을 만들 수 있다.
pandas 입출력 가능한 포맷의 종류는 다음과 같다.

CSV
Clipboard
Excel
JSON
HTML
Python Pickling
Feather
Msgpack
HDF5
SAS
STATA
SQL
Google BigQuery
여기에서는 가장 단순하지만 널리 사용되는 CSV 포맷 입출력에 대해 살펴본다.
CSV 파일 포맷은 값들이 comma로 구분되는 텍스트 파일이다.
"""

In [ ]:
# %%writefile : magic command
%%writefile data/sample1.csv
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing data/sample1.csv

In [3]:
import pandas as pd
# pandas.from_csv(), pandas.read_csv() : csv파일 불러오기
pd.read_csv("data/sample1.csv")

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>c1</th>
      <th>c2</th>
      <th>c3</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>1.11</td>
      <td>one</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2</td>
      <td>2.22</td>
      <td>two</td>
    </tr>
    <tr>
      <th>2</th>
      <td>3</td>
      <td>3.33</td>
      <td>three</td>
    </tr>
  </tbody>
</table>
</div>

In [1]:
%%writefile data/sample2.csv
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing data/sample2.csv

In [9]:
# csv에 컬럼명이 없이 데이터 만들기
pd.read_csv("data/sample2.csv")

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>1</th>
      <th>1.11</th>
      <th>one</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>2</td>
      <td>2.22</td>
      <td>two</td>
    </tr>
    <tr>
      <th>1</th>
      <td>3</td>
      <td>3.33</td>
      <td>three</td>
    </tr>
  </tbody>
</table>
</div>

In [10]:
# csv에 컬럼 label이 없는 경우 name을 이용하여 설정 가능
pd.read_csv("data/sample2.csv", names=["c1", "c2", "c3"])

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>c1</th>
      <th>c2</th>
      <th>c3</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>1.11</td>
      <td>one</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2</td>
      <td>2.22</td>
      <td>two</td>
    </tr>
    <tr>
      <th>2</th>
      <td>3</td>
      <td>3.33</td>
      <td>three</td>
    </tr>
  </tbody>
</table>
</div>

In [16]:
# 만약 특정한 컬럼을 index로 지정하고 싶으면 index_col 인수 사용
pd.read_csv("data/sample1.csv", index_col="c1")

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>c2</th>
      <th>c3</th>
    </tr>
    <tr>
      <th>c1</th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>1</th>
      <td>1.11</td>
      <td>one</td>
    </tr>
    <tr>
      <th>2</th>
      <td>2.22</td>
      <td>two</td>
    </tr>
    <tr>
      <th>3</th>
      <td>3.33</td>
      <td>three</td>
    </tr>
  </tbody>
</table>
</div>

In [ ]:
"""
확장자가 CSV가 아닌 파일 즉, 구분자가 comma가 아닌 경우에도
sep 인수를 써서 구분자를 지정하면 읽을 수 있다.
만약 구분자가 길이가 정해지지 않은 공백인 경우에는 \s+라는
정규식(regular expression) 문자열을 사용한다.
"""

In [17]:
%%writefile data/sample3.txt
c1        c2        c3        c4 
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Writing data/sample3.txt

In [18]:
# 확장자가 txt일 경우에는 read_table()
# sep="\s+"
pd.read_table("data/sample3.txt", sep="\s+")

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>c1</th>
      <th>c2</th>
      <th>c3</th>
      <th>c4</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>0.179181</td>
      <td>-1.538472</td>
      <td>1.347553</td>
      <td>0.43381</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1.024209</td>
      <td>0.087307</td>
      <td>-1.281997</td>
      <td>0.49265</td>
    </tr>
    <tr>
      <th>2</th>
      <td>0.417899</td>
      <td>-2.002308</td>
      <td>0.255245</td>
      <td>-1.10515</td>
    </tr>
  </tbody>
</table>
</div>

In [19]:
%%writefile data/sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명: 
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing data/sample4.txt

In [20]:
pd.read_table("data/sample4.txt", sep="\s+")

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>파일</th>
      <th>제목:</th>
      <th>sample4.txt</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>데이터</td>
      <td>포맷의</td>
      <td>설명:</td>
    </tr>
    <tr>
      <th>1</th>
      <td>c1,</td>
      <td>c2,</td>
      <td>c3</td>
    </tr>
    <tr>
      <th>2</th>
      <td>1,</td>
      <td>1.11,</td>
      <td>one</td>
    </tr>
    <tr>
      <th>3</th>
      <td>2,</td>
      <td>2.22,</td>
      <td>two</td>
    </tr>
    <tr>
      <th>4</th>
      <td>3,</td>
      <td>3.33,</td>
      <td>three</td>
    </tr>
  </tbody>
</table>
</div>

In [22]:
# 만약 자료 파일 중에 건너 뛰어야 할 행이 있으면 skiprows 인수를 사용
pd.read_table("data/sample4.txt", skiprows=[0, 1], sep="\s+")

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>c1,</th>
      <th>c2,</th>
      <th>c3</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1,</td>
      <td>1.11,</td>
      <td>one</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2,</td>
      <td>2.22,</td>
      <td>two</td>
    </tr>
    <tr>
      <th>2</th>
      <td>3,</td>
      <td>3.33,</td>
      <td>three</td>
    </tr>
  </tbody>
</table>
</div>

In [23]:
%%writefile data/sample5.csv
c1, c2, c3
1, 1.11, one
2,, two
누락, 3.33, three

Writing data/sample5.csv

In [24]:
pd.read_csv("data/sample5.csv")

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>c1</th>
      <th>c2</th>
      <th>c3</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>1.11</td>
      <td>one</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2</td>
      <td>NaN</td>
      <td>two</td>
    </tr>
    <tr>
      <th>2</th>
      <td>누락</td>
      <td>3.33</td>
      <td>three</td>
    </tr>
  </tbody>
</table>
</div>

In [36]:
# 특정한 값을 NaN으로 취급하고 싶으면 na_values 인수에
# NaN 값으로 취급할 값을 넣는다.
df = pd.read_csv("data/sample5.csv", na_values=["누락"])
df

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>c1</th>
      <th>c2</th>
      <th>c3</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1.0</td>
      <td>1.11</td>
      <td>one</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2.0</td>
      <td>NaN</td>
      <td>two</td>
    </tr>
    <tr>
      <th>2</th>
      <td>NaN</td>
      <td>3.33</td>
      <td>three</td>
    </tr>
  </tbody>
</table>
</div>

In [ ]:
"""
csv file 출력
반대로 DataFrame 값을 csv file로 출력하고 싶다면 
to_csv() 이용
"""

In [47]:
df.to_csv("data/sample6.csv")
# !cat data/sample6.csv
# ,c1, c2, c3
# 0,1.0,1.11, one
# 1,2.0,, two
# 2,,3.33, three

In [65]:
# 읽을 때와 마찬가지로 sep 인수로 구분자를 변경할 수도 있다.
df.to_csv("data/sample7.csv", sep="|")
# !cat ~/data/sample7.txt
# |c1| c2| c3
# 0|1.0|1.11| one
# 1|2.0|| two
# 2||3.33| three

In [74]:
# na_rep 인수로 NA 표시값을 바꿀 수도 있다.
df.to_csv('data/sample8.csv', na_rep='누락')
# !cat ~/data/sample8.csv
# ,c1, c2, c3
# 0,1.0,1.11, one
# 1,2.0,누락, two
# 2,누락,3.33, three

In [80]:
# 마지막으로 index, header 인수를 지정하여 
# 인덱스 및 헤더 출력 여부를 지정한다.
df.index = ["a", "b", "c"]
df

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>c1</th>
      <th>c2</th>
      <th>c3</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>a</th>
      <td>1.0</td>
      <td>1.11</td>
      <td>one</td>
    </tr>
    <tr>
      <th>b</th>
      <td>2.0</td>
      <td>NaN</td>
      <td>two</td>
    </tr>
    <tr>
      <th>c</th>
      <td>NaN</td>
      <td>3.33</td>
      <td>three</td>
    </tr>
  </tbody>
</table>
</div>

In [81]:
df.to_csv("data/sample9.csv", index=False, header=False)
# !cat ~/data/sample9.csv
# 1.0,1.11, one
# 2.0,, two
# ,3.33, three

In [ ]:
"""
 인터넷 상의 CSV 파일 입력
 
 웹상에는 다양한 데이터 파일이 CSV 파일 형태로 제공된다.
 read_csv 명령 사용시 파일 패스 대신 URL을 지정하면
 Pandas가 직접 해당 파일을 다운로드하여 읽어들인다. 
 다음은 구글 파이낸스에서 제공하는 애플의 주가 데이터를
 담은 csv 파일을 읽는 법이다.
"""

In [82]:
df = pd.read_csv("http://www.google.com/finance/historical?q=NASDAQ%3AAAPL&ei=a095WYHnMYSO0QTTz47YDA&output=csv")

In [83]:
df

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Date</th>
      <th>Open</th>
      <th>High</th>
      <th>Low</th>
      <th>Close</th>
      <th>Volume</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>26-Jul-17</td>
      <td>153.35</td>
      <td>153.93</td>
      <td>153.06</td>
      <td>153.46</td>
      <td>15780951</td>
    </tr>
    <tr>
      <th>1</th>
      <td>25-Jul-17</td>
      <td>151.80</td>
      <td>153.84</td>
      <td>151.80</td>
      <td>152.74</td>
      <td>18853932</td>
    </tr>
    <tr>
      <th>2</th>
      <td>24-Jul-17</td>
      <td>150.58</td>
      <td>152.44</td>
      <td>149.90</td>
      <td>152.09</td>
      <td>21493160</td>
    </tr>
    <tr>
      <th>3</th>
      <td>21-Jul-17</td>
      <td>149.99</td>
      <td>150.44</td>
      <td>148.88</td>
      <td>150.27</td>
      <td>26252630</td>
    </tr>
    <tr>
      <th>4</th>
      <td>20-Jul-17</td>
      <td>151.50</td>
      <td>151.74</td>
      <td>150.19</td>
      <td>150.34</td>
      <td>17243748</td>
    </tr>
    <tr>
      <th>5</th>
      <td>19-Jul-17</td>
      <td>150.48</td>
      <td>151.42</td>
      <td>149.95</td>
      <td>151.02</td>
      <td>20922969</td>
    </tr>
    <tr>
      <th>6</th>
      <td>18-Jul-17</td>
      <td>149.20</td>
      <td>150.13</td>
      <td>148.67</td>
      <td>150.08</td>
      <td>17868792</td>
    </tr>
    <tr>
      <th>7</th>
      <td>17-Jul-17</td>
      <td>148.82</td>
      <td>150.90</td>
      <td>148.57</td>
      <td>149.56</td>
      <td>23793456</td>
    </tr>
    <tr>
      <th>8</th>
      <td>14-Jul-17</td>
      <td>147.97</td>
      <td>149.33</td>
      <td>147.33</td>
      <td>149.04</td>
      <td>20132061</td>
    </tr>
    <tr>
      <th>9</th>
      <td>13-Jul-17</td>
      <td>145.50</td>
      <td>148.49</td>
      <td>145.44</td>
      <td>147.77</td>
      <td>25199373</td>
    </tr>
    <tr>
      <th>10</th>
      <td>12-Jul-17</td>
      <td>145.87</td>
      <td>146.18</td>
      <td>144.82</td>
      <td>145.74</td>
      <td>24884478</td>
    </tr>
    <tr>
      <th>11</th>
      <td>11-Jul-17</td>
      <td>144.73</td>
      <td>145.85</td>
      <td>144.38</td>
      <td>145.53</td>
      <td>19781836</td>
    </tr>
    <tr>
      <th>12</th>
      <td>10-Jul-17</td>
      <td>144.11</td>
      <td>145.95</td>
      <td>143.37</td>
      <td>145.06</td>
      <td>21090636</td>
    </tr>
    <tr>
      <th>13</th>
      <td>7-Jul-17</td>
      <td>142.90</td>
      <td>144.75</td>
      <td>142.90</td>
      <td>144.18</td>
      <td>19201712</td>
    </tr>
    <tr>
      <th>14</th>
      <td>6-Jul-17</td>
      <td>143.02</td>
      <td>143.50</td>
      <td>142.41</td>
      <td>142.73</td>
      <td>24128782</td>
    </tr>
    <tr>
      <th>15</th>
      <td>5-Jul-17</td>
      <td>143.69</td>
      <td>144.79</td>
      <td>142.72</td>
      <td>144.09</td>
      <td>21569557</td>
    </tr>
    <tr>
      <th>16</th>
      <td>3-Jul-17</td>
      <td>144.88</td>
      <td>145.30</td>
      <td>143.10</td>
      <td>143.50</td>
      <td>14277848</td>
    </tr>
    <tr>
      <th>17</th>
      <td>30-Jun-17</td>
      <td>144.45</td>
      <td>144.96</td>
      <td>143.78</td>
      <td>144.02</td>
      <td>23024107</td>
    </tr>
    <tr>
      <th>18</th>
      <td>29-Jun-17</td>
      <td>144.71</td>
      <td>145.13</td>
      <td>142.28</td>
      <td>143.68</td>
      <td>31499368</td>
    </tr>
    <tr>
      <th>19</th>
      <td>28-Jun-17</td>
      <td>144.49</td>
      <td>146.11</td>
      <td>143.16</td>
      <td>145.83</td>
      <td>22082432</td>
    </tr>
    <tr>
      <th>20</th>
      <td>27-Jun-17</td>
      <td>145.01</td>
      <td>146.16</td>
      <td>143.62</td>
      <td>143.73</td>
      <td>24761891</td>
    </tr>
    <tr>
      <th>21</th>
      <td>26-Jun-17</td>
      <td>147.17</td>
      <td>148.28</td>
      <td>145.38</td>
      <td>145.82</td>
      <td>25692361</td>
    </tr>
    <tr>
      <th>22</th>
      <td>23-Jun-17</td>
      <td>145.13</td>
      <td>147.16</td>
      <td>145.11</td>
      <td>146.28</td>
      <td>35439389</td>
    </tr>
    <tr>
      <th>23</th>
      <td>22-Jun-17</td>
      <td>145.77</td>
      <td>146.70</td>
      <td>145.12</td>
      <td>145.63</td>
      <td>19106294</td>
    </tr>
    <tr>
      <th>24</th>
      <td>21-Jun-17</td>
      <td>145.52</td>
      <td>146.07</td>
      <td>144.61</td>
      <td>145.87</td>
      <td>21265751</td>
    </tr>
    <tr>
      <th>25</th>
      <td>20-Jun-17</td>
      <td>146.87</td>
      <td>146.87</td>
      <td>144.94</td>
      <td>145.01</td>
      <td>24900073</td>
    </tr>
    <tr>
      <th>26</th>
      <td>19-Jun-17</td>
      <td>143.66</td>
      <td>146.74</td>
      <td>143.66</td>
      <td>146.34</td>
      <td>32541404</td>
    </tr>
    <tr>
      <th>27</th>
      <td>16-Jun-17</td>
      <td>143.78</td>
      <td>144.50</td>
      <td>142.20</td>
      <td>142.27</td>
      <td>50361093</td>
    </tr>
    <tr>
      <th>28</th>
      <td>15-Jun-17</td>
      <td>143.32</td>
      <td>144.48</td>
      <td>142.21</td>
      <td>144.29</td>
      <td>32165373</td>
    </tr>
    <tr>
      <th>29</th>
      <td>14-Jun-17</td>
      <td>147.50</td>
      <td>147.50</td>
      <td>143.84</td>
      <td>145.16</td>
      <td>31531232</td>
    </tr>
    <tr>
      <th>...</th>
      <td>...</td>
      <td>...</td>
      <td>...</td>
      <td>...</td>
      <td>...</td>
      <td>...</td>
    </tr>
    <tr>
      <th>221</th>
      <td>8-Sep-16</td>
      <td>107.25</td>
      <td>107.27</td>
      <td>105.24</td>
      <td>105.52</td>
      <td>53002026</td>
    </tr>
    <tr>
      <th>222</th>
      <td>7-Sep-16</td>
      <td>107.83</td>
      <td>108.76</td>
      <td>107.07</td>
      <td>108.36</td>
      <td>42364328</td>
    </tr>
    <tr>
      <th>223</th>
      <td>6-Sep-16</td>
      <td>107.90</td>
      <td>108.30</td>
      <td>107.51</td>
      <td>107.70</td>
      <td>26880391</td>
    </tr>
    <tr>
      <th>224</th>
      <td>2-Sep-16</td>
      <td>107.70</td>
      <td>108.00</td>
      <td>106.82</td>
      <td>107.73</td>
      <td>26334858</td>
    </tr>
    <tr>
      <th>225</th>
      <td>1-Sep-16</td>
      <td>106.14</td>
      <td>106.80</td>
      <td>105.62</td>
      <td>106.73</td>
      <td>26701523</td>
    </tr>
    <tr>
      <th>226</th>
      <td>31-Aug-16</td>
      <td>105.66</td>
      <td>106.57</td>
      <td>105.64</td>
      <td>106.10</td>
      <td>29662406</td>
    </tr>
    <tr>
      <th>227</th>
      <td>30-Aug-16</td>
      <td>105.80</td>
      <td>106.50</td>
      <td>105.50</td>
      <td>106.00</td>
      <td>24863945</td>
    </tr>
    <tr>
      <th>228</th>
      <td>29-Aug-16</td>
      <td>106.62</td>
      <td>107.44</td>
      <td>106.29</td>
      <td>106.82</td>
      <td>24970300</td>
    </tr>
    <tr>
      <th>229</th>
      <td>26-Aug-16</td>
      <td>107.41</td>
      <td>107.95</td>
      <td>106.31</td>
      <td>106.94</td>
      <td>27766291</td>
    </tr>
    <tr>
      <th>230</th>
      <td>25-Aug-16</td>
      <td>107.39</td>
      <td>107.88</td>
      <td>106.68</td>
      <td>107.57</td>
      <td>25086248</td>
    </tr>
    <tr>
      <th>231</th>
      <td>24-Aug-16</td>
      <td>108.56</td>
      <td>108.75</td>
      <td>107.68</td>
      <td>108.03</td>
      <td>23675081</td>
    </tr>
    <tr>
      <th>232</th>
      <td>23-Aug-16</td>
      <td>108.59</td>
      <td>109.32</td>
      <td>108.53</td>
      <td>108.85</td>
      <td>21257669</td>
    </tr>
    <tr>
      <th>233</th>
      <td>22-Aug-16</td>
      <td>108.86</td>
      <td>109.10</td>
      <td>107.85</td>
      <td>108.51</td>
      <td>25820230</td>
    </tr>
    <tr>
      <th>234</th>
      <td>19-Aug-16</td>
      <td>108.77</td>
      <td>109.69</td>
      <td>108.36</td>
      <td>109.36</td>
      <td>25368072</td>
    </tr>
    <tr>
      <th>235</th>
      <td>18-Aug-16</td>
      <td>109.23</td>
      <td>109.60</td>
      <td>109.02</td>
      <td>109.08</td>
      <td>21984703</td>
    </tr>
    <tr>
      <th>236</th>
      <td>17-Aug-16</td>
      <td>109.10</td>
      <td>109.37</td>
      <td>108.34</td>
      <td>109.22</td>
      <td>25355976</td>
    </tr>
    <tr>
      <th>237</th>
      <td>16-Aug-16</td>
      <td>109.63</td>
      <td>110.23</td>
      <td>109.21</td>
      <td>109.38</td>
      <td>33794448</td>
    </tr>
    <tr>
      <th>238</th>
      <td>15-Aug-16</td>
      <td>108.14</td>
      <td>109.54</td>
      <td>108.08</td>
      <td>109.48</td>
      <td>25868209</td>
    </tr>
    <tr>
      <th>239</th>
      <td>12-Aug-16</td>
      <td>107.78</td>
      <td>108.44</td>
      <td>107.78</td>
      <td>108.18</td>
      <td>18660434</td>
    </tr>
    <tr>
      <th>240</th>
      <td>11-Aug-16</td>
      <td>108.52</td>
      <td>108.93</td>
      <td>107.85</td>
      <td>107.93</td>
      <td>27484506</td>
    </tr>
    <tr>
      <th>241</th>
      <td>10-Aug-16</td>
      <td>108.71</td>
      <td>108.90</td>
      <td>107.76</td>
      <td>108.00</td>
      <td>24008505</td>
    </tr>
    <tr>
      <th>242</th>
      <td>9-Aug-16</td>
      <td>108.23</td>
      <td>108.94</td>
      <td>108.01</td>
      <td>108.81</td>
      <td>26315204</td>
    </tr>
    <tr>
      <th>243</th>
      <td>8-Aug-16</td>
      <td>107.52</td>
      <td>108.37</td>
      <td>107.16</td>
      <td>108.37</td>
      <td>28037220</td>
    </tr>
    <tr>
      <th>244</th>
      <td>5-Aug-16</td>
      <td>106.27</td>
      <td>107.65</td>
      <td>106.18</td>
      <td>107.48</td>
      <td>40553402</td>
    </tr>
    <tr>
      <th>245</th>
      <td>4-Aug-16</td>
      <td>105.58</td>
      <td>106.00</td>
      <td>105.28</td>
      <td>105.87</td>
      <td>27408650</td>
    </tr>
    <tr>
      <th>246</th>
      <td>3-Aug-16</td>
      <td>104.81</td>
      <td>105.84</td>
      <td>104.77</td>
      <td>105.79</td>
      <td>30202641</td>
    </tr>
    <tr>
      <th>247</th>
      <td>2-Aug-16</td>
      <td>106.05</td>
      <td>106.07</td>
      <td>104.00</td>
      <td>104.48</td>
      <td>33816556</td>
    </tr>
    <tr>
      <th>248</th>
      <td>1-Aug-16</td>
      <td>104.41</td>
      <td>106.15</td>
      <td>104.41</td>
      <td>106.05</td>
      <td>38167871</td>
    </tr>
    <tr>
      <th>249</th>
      <td>29-Jul-16</td>
      <td>104.19</td>
      <td>104.55</td>
      <td>103.68</td>
      <td>104.21</td>
      <td>27733688</td>
    </tr>
    <tr>
      <th>250</th>
      <td>28-Jul-16</td>
      <td>102.83</td>
      <td>104.45</td>
      <td>102.82</td>
      <td>104.34</td>
      <td>39869839</td>
    </tr>
  </tbody>
</table>
<p>251 rows × 6 columns</p>
</div>

In [90]:
df.to_csv("data/apple.csv")
# 만약 앞이나 뒤의 특정 갯수만 보고 싶다면
#  head 메서드나 tail 메서드를 이용한다.
df.head(10)

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Date</th>
      <th>Open</th>
      <th>High</th>
      <th>Low</th>
      <th>Close</th>
      <th>Volume</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>26-Jul-17</td>
      <td>153.35</td>
      <td>153.93</td>
      <td>153.06</td>
      <td>153.46</td>
      <td>15780951</td>
    </tr>
    <tr>
      <th>1</th>
      <td>25-Jul-17</td>
      <td>151.80</td>
      <td>153.84</td>
      <td>151.80</td>
      <td>152.74</td>
      <td>18853932</td>
    </tr>
    <tr>
      <th>2</th>
      <td>24-Jul-17</td>
      <td>150.58</td>
      <td>152.44</td>
      <td>149.90</td>
      <td>152.09</td>
      <td>21493160</td>
    </tr>
    <tr>
      <th>3</th>
      <td>21-Jul-17</td>
      <td>149.99</td>
      <td>150.44</td>
      <td>148.88</td>
      <td>150.27</td>
      <td>26252630</td>
    </tr>
    <tr>
      <th>4</th>
      <td>20-Jul-17</td>
      <td>151.50</td>
      <td>151.74</td>
      <td>150.19</td>
      <td>150.34</td>
      <td>17243748</td>
    </tr>
    <tr>
      <th>5</th>
      <td>19-Jul-17</td>
      <td>150.48</td>
      <td>151.42</td>
      <td>149.95</td>
      <td>151.02</td>
      <td>20922969</td>
    </tr>
    <tr>
      <th>6</th>
      <td>18-Jul-17</td>
      <td>149.20</td>
      <td>150.13</td>
      <td>148.67</td>
      <td>150.08</td>
      <td>17868792</td>
    </tr>
    <tr>
      <th>7</th>
      <td>17-Jul-17</td>
      <td>148.82</td>
      <td>150.90</td>
      <td>148.57</td>
      <td>149.56</td>
      <td>23793456</td>
    </tr>
    <tr>
      <th>8</th>
      <td>14-Jul-17</td>
      <td>147.97</td>
      <td>149.33</td>
      <td>147.33</td>
      <td>149.04</td>
      <td>20132061</td>
    </tr>
    <tr>
      <th>9</th>
      <td>13-Jul-17</td>
      <td>145.50</td>
      <td>148.49</td>
      <td>145.44</td>
      <td>147.77</td>
      <td>25199373</td>
    </tr>
  </tbody>
</table>
</div>

In [91]:
df.tail()

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Date</th>
      <th>Open</th>
      <th>High</th>
      <th>Low</th>
      <th>Close</th>
      <th>Volume</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>246</th>
      <td>3-Aug-16</td>
      <td>104.81</td>
      <td>105.84</td>
      <td>104.77</td>
      <td>105.79</td>
      <td>30202641</td>
    </tr>
    <tr>
      <th>247</th>
      <td>2-Aug-16</td>
      <td>106.05</td>
      <td>106.07</td>
      <td>104.00</td>
      <td>104.48</td>
      <td>33816556</td>
    </tr>
    <tr>
      <th>248</th>
      <td>1-Aug-16</td>
      <td>104.41</td>
      <td>106.15</td>
      <td>104.41</td>
      <td>106.05</td>
      <td>38167871</td>
    </tr>
    <tr>
      <th>249</th>
      <td>29-Jul-16</td>
      <td>104.19</td>
      <td>104.55</td>
      <td>103.68</td>
      <td>104.21</td>
      <td>27733688</td>
    </tr>
    <tr>
      <th>250</th>
      <td>28-Jul-16</td>
      <td>102.83</td>
      <td>104.45</td>
      <td>102.82</td>
      <td>104.34</td>
      <td>39869839</td>
    </tr>
  </tbody>
</table>
</div>

In [ ]:
"""
인터넷 상의 데이터 베이스 자료 입력

다음과 같은 인터넷 상의 자료는 pandas_datareader 패키지의
DataReader 을 써서 바로 pandas로 입력할 수도 있다.

Yahoo! Finance
Google Finance
Enigma
FRED
Fama/French
World Bank
OECD
Eurostat
EDGAR Index
TSP Fund Data
Oanda currency historical rate
Nasdaq Trader Symbol Definitions

자세한 내용은 다음 웹사이트를 참조한다.
https://pandas-datareader.readthedocs.io/en/latest/index.html
"""

In [93]:
from pandas_datareader.data import DataReader as pdr
# 날짜는 datetime 패키지를 사용하여 지정해도 되고
# 문자열을 바로 사용해도 된다.
# (이때는 내부적으로 dateutil 패키지를 사용한다.)
import datetime

In [95]:
start = datetime.datetime(2015, 1, 1)
end = "2016, 6, 30"

In [ ]:
"""
data_source 인수로 데이터를 읽어올 웹사이트를 지정할 수 있다.
이 때 데이터의 이름을 지정하는 코드는 웹사이트마다 다르므로 주의한다.
예를 들어 삼성전자 주가는 yahoo에서는 005930.KS로 지정하지만
google에서는 KRX:005930이다.
"""

In [99]:
df = pdr("KRX:005930", "google", start, end)
df.to_csv("data/samsung.csv")
df.tail()

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Open</th>
      <th>High</th>
      <th>Low</th>
      <th>Close</th>
      <th>Volume</th>
    </tr>
    <tr>
      <th>Date</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>2016-06-24</th>
      <td>1445000.0</td>
      <td>1445000.0</td>
      <td>1360000.0</td>
      <td>1400000.0</td>
      <td>408920</td>
    </tr>
    <tr>
      <th>2016-06-27</th>
      <td>1400000.0</td>
      <td>1405000.0</td>
      <td>1385000.0</td>
      <td>1398000.0</td>
      <td>236573</td>
    </tr>
    <tr>
      <th>2016-06-28</th>
      <td>1390000.0</td>
      <td>1404000.0</td>
      <td>1379000.0</td>
      <td>1399000.0</td>
      <td>213829</td>
    </tr>
    <tr>
      <th>2016-06-29</th>
      <td>1408000.0</td>
      <td>1412000.0</td>
      <td>1391000.0</td>
      <td>1396000.0</td>
      <td>208090</td>
    </tr>
    <tr>
      <th>2016-06-30</th>
      <td>1408000.0</td>
      <td>1445000.0</td>
      <td>1397000.0</td>
      <td>1425000.0</td>
      <td>272883</td>
    </tr>
  </tbody>
</table>
</div>

In [100]:
"""
다음은 FRED 데이터베이스에서 
미국 국가총생산(GDP),
모든 항목을 포함한 소비자 가격 지수(CPIAUCSL), 
식료품 및 연로를 제외한 소비자 가격 지수(CPILFESL)를 가져오는 예이다.

https://fred.stlouisfed.org/series/GDP
https://fred.stlouisfed.org/series/CPIAUCSL
https://fred.stlouisfed.org/series/CPILFESL
"""

In [105]:
gdp = pdr("GDP", "fred")
gdp.to_csv("data/gdp.csv")
gdp

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>GDP</th>
    </tr>
    <tr>
      <th>DATE</th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>2010-01-01</th>
      <td>14681.1</td>
    </tr>
    <tr>
      <th>2010-04-01</th>
      <td>14888.6</td>
    </tr>
    <tr>
      <th>2010-07-01</th>
      <td>15057.7</td>
    </tr>
    <tr>
      <th>2010-10-01</th>
      <td>15230.2</td>
    </tr>
    <tr>
      <th>2011-01-01</th>
      <td>15238.4</td>
    </tr>
    <tr>
      <th>2011-04-01</th>
      <td>15460.9</td>
    </tr>
    <tr>
      <th>2011-07-01</th>
      <td>15587.1</td>
    </tr>
    <tr>
      <th>2011-10-01</th>
      <td>15785.3</td>
    </tr>
    <tr>
      <th>2012-01-01</th>
      <td>15973.9</td>
    </tr>
    <tr>
      <th>2012-04-01</th>
      <td>16121.9</td>
    </tr>
    <tr>
      <th>2012-07-01</th>
      <td>16227.9</td>
    </tr>
    <tr>
      <th>2012-10-01</th>
      <td>16297.3</td>
    </tr>
    <tr>
      <th>2013-01-01</th>
      <td>16475.4</td>
    </tr>
    <tr>
      <th>2013-04-01</th>
      <td>16541.4</td>
    </tr>
    <tr>
      <th>2013-07-01</th>
      <td>16749.3</td>
    </tr>
    <tr>
      <th>2013-10-01</th>
      <td>16999.9</td>
    </tr>
    <tr>
      <th>2014-01-01</th>
      <td>17025.2</td>
    </tr>
    <tr>
      <th>2014-04-01</th>
      <td>17285.6</td>
    </tr>
    <tr>
      <th>2014-07-01</th>
      <td>17569.4</td>
    </tr>
    <tr>
      <th>2014-10-01</th>
      <td>17692.2</td>
    </tr>
    <tr>
      <th>2015-01-01</th>
      <td>17783.6</td>
    </tr>
    <tr>
      <th>2015-04-01</th>
      <td>17998.3</td>
    </tr>
    <tr>
      <th>2015-07-01</th>
      <td>18141.9</td>
    </tr>
    <tr>
      <th>2015-10-01</th>
      <td>18222.8</td>
    </tr>
    <tr>
      <th>2016-01-01</th>
      <td>18281.6</td>
    </tr>
    <tr>
      <th>2016-04-01</th>
      <td>18450.1</td>
    </tr>
    <tr>
      <th>2016-07-01</th>
      <td>18675.3</td>
    </tr>
    <tr>
      <th>2016-10-01</th>
      <td>18869.4</td>
    </tr>
    <tr>
      <th>2017-01-01</th>
      <td>19027.1</td>
    </tr>
  </tbody>
</table>
</div>

In [114]:
# 종목 코드에 list를 넣으면 복수 종목에 대한 데이터를 가져온다.
inflation = pdr(["CPIAUCSL", "CPILFESL"], "fred", start, end)
inflation.to_csv("data/inflation.csv")
inflation

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>CPIAUCSL</th>
      <th>CPILFESL</th>
    </tr>
    <tr>
      <th>DATE</th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>2015-01-01</th>
      <td>234.913</td>
      <td>239.910</td>
    </tr>
    <tr>
      <th>2015-02-01</th>
      <td>235.489</td>
      <td>240.236</td>
    </tr>
    <tr>
      <th>2015-03-01</th>
      <td>235.989</td>
      <td>240.783</td>
    </tr>
    <tr>
      <th>2015-04-01</th>
      <td>236.201</td>
      <td>241.366</td>
    </tr>
    <tr>
      <th>2015-05-01</th>
      <td>236.891</td>
      <td>241.662</td>
    </tr>
    <tr>
      <th>2015-06-01</th>
      <td>237.419</td>
      <td>242.021</td>
    </tr>
    <tr>
      <th>2015-07-01</th>
      <td>237.876</td>
      <td>242.480</td>
    </tr>
    <tr>
      <th>2015-08-01</th>
      <td>237.811</td>
      <td>242.754</td>
    </tr>
    <tr>
      <th>2015-09-01</th>
      <td>237.467</td>
      <td>243.249</td>
    </tr>
    <tr>
      <th>2015-10-01</th>
      <td>237.792</td>
      <td>243.719</td>
    </tr>
    <tr>
      <th>2015-11-01</th>
      <td>238.153</td>
      <td>244.221</td>
    </tr>
    <tr>
      <th>2015-12-01</th>
      <td>237.846</td>
      <td>244.581</td>
    </tr>
    <tr>
      <th>2016-01-01</th>
      <td>238.106</td>
      <td>245.232</td>
    </tr>
    <tr>
      <th>2016-02-01</th>
      <td>237.808</td>
      <td>245.845</td>
    </tr>
    <tr>
      <th>2016-03-01</th>
      <td>238.078</td>
      <td>246.062</td>
    </tr>
    <tr>
      <th>2016-04-01</th>
      <td>238.908</td>
      <td>246.517</td>
    </tr>
    <tr>
      <th>2016-05-01</th>
      <td>239.362</td>
      <td>247.026</td>
    </tr>
    <tr>
      <th>2016-06-01</th>
      <td>239.842</td>
      <td>247.389</td>
    </tr>
  </tbody>
</table>
</div>